MikroElektronika/core_packages/PIC/XC8/def/PIC16F19175/mcu.h
// Register: LCDVCON1
#define LCDVCON1 LCDVCON1
extern volatile unsigned char           LCDVCON1            __at(0x1D14);
#ifndef _LIB_BUILD
asm("LCDVCON1 equ 01D14h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BIAS                   :3;
        unsigned                        :3;
        unsigned EN5V                   :1;
        unsigned LPEN                   :1;
    };
    struct {
        unsigned BIAS0                  :1;
        unsigned BIAS1                  :1;
        unsigned BIAS2                  :1;
    };
} LCDVCON1bits_t;
extern volatile LCDVCON1bits_t LCDVCON1bits __at(0x1D14);
// bitfield macros
#define _LCDVCON1_BIAS_POSN                                 0x0
#define _LCDVCON1_BIAS_POSITION                             0x0
#define _LCDVCON1_BIAS_SIZE                                 0x3
#define _LCDVCON1_BIAS_LENGTH                               0x3
#define _LCDVCON1_BIAS_MASK                                 0x7
#define _LCDVCON1_EN5V_POSN                                 0x6
#define _LCDVCON1_EN5V_POSITION                             0x6
#define _LCDVCON1_EN5V_SIZE                                 0x1
#define _LCDVCON1_EN5V_LENGTH                               0x1
#define _LCDVCON1_EN5V_MASK                                 0x40
#define _LCDVCON1_LPEN_POSN                                 0x7
#define _LCDVCON1_LPEN_POSITION                             0x7
#define _LCDVCON1_LPEN_SIZE                                 0x1
#define _LCDVCON1_LPEN_LENGTH                               0x1
#define _LCDVCON1_LPEN_MASK                                 0x80
#define _LCDVCON1_BIAS0_POSN                                0x0
#define _LCDVCON1_BIAS0_POSITION                            0x0
#define _LCDVCON1_BIAS0_SIZE                                0x1
#define _LCDVCON1_BIAS0_LENGTH                              0x1
#define _LCDVCON1_BIAS0_MASK                                0x1
#define _LCDVCON1_BIAS1_POSN                                0x1
#define _LCDVCON1_BIAS1_POSITION                            0x1
#define _LCDVCON1_BIAS1_SIZE                                0x1
#define _LCDVCON1_BIAS1_LENGTH                              0x1
#define _LCDVCON1_BIAS1_MASK                                0x2
#define _LCDVCON1_BIAS2_POSN                                0x2
#define _LCDVCON1_BIAS2_POSITION                            0x2
#define _LCDVCON1_BIAS2_SIZE                                0x1
#define _LCDVCON1_BIAS2_LENGTH                              0x1
#define _LCDVCON1_BIAS2_MASK                                0x4

// Register: LCDVCON2
#define LCDVCON2 LCDVCON2
extern volatile unsigned char           LCDVCON2            __at(0x1D15);
#ifndef _LIB_BUILD
asm("LCDVCON2 equ 01D15h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LCDVSRC                :4;
        unsigned                        :3;
        unsigned CPWDT                  :1;
    };
    struct {
        unsigned LCDVSRC0               :1;
        unsigned LCDVSRC1               :1;
        unsigned LCDVSRC2               :1;
        unsigned LCDVSRC3               :1;
    };
} LCDVCON2bits_t;
extern volatile LCDVCON2bits_t LCDVCON2bits __at(0x1D15);
// bitfield macros
#define _LCDVCON2_LCDVSRC_POSN                              0x0
#define _LCDVCON2_LCDVSRC_POSITION                          0x0
#define _LCDVCON2_LCDVSRC_SIZE                              0x4
#define _LCDVCON2_LCDVSRC_LENGTH                            0x4
#define _LCDVCON2_LCDVSRC_MASK                              0xF
#define _LCDVCON2_CPWDT_POSN                                0x7
#define _LCDVCON2_CPWDT_POSITION                            0x7
#define _LCDVCON2_CPWDT_SIZE                                0x1
#define _LCDVCON2_CPWDT_LENGTH                              0x1
#define _LCDVCON2_CPWDT_MASK                                0x80
#define _LCDVCON2_LCDVSRC0_POSN                             0x0
#define _LCDVCON2_LCDVSRC0_POSITION                         0x0
#define _LCDVCON2_LCDVSRC0_SIZE                             0x1
#define _LCDVCON2_LCDVSRC0_LENGTH                           0x1
#define _LCDVCON2_LCDVSRC0_MASK                             0x1
#define _LCDVCON2_LCDVSRC1_POSN                             0x1
#define _LCDVCON2_LCDVSRC1_POSITION                         0x1
#define _LCDVCON2_LCDVSRC1_SIZE                             0x1
#define _LCDVCON2_LCDVSRC1_LENGTH                           0x1
#define _LCDVCON2_LCDVSRC1_MASK                             0x2
#define _LCDVCON2_LCDVSRC2_POSN                             0x2
#define _LCDVCON2_LCDVSRC2_POSITION                         0x2
#define _LCDVCON2_LCDVSRC2_SIZE                             0x1
#define _LCDVCON2_LCDVSRC2_LENGTH                           0x1
#define _LCDVCON2_LCDVSRC2_MASK                             0x4
#define _LCDVCON2_LCDVSRC3_POSN                             0x3
#define _LCDVCON2_LCDVSRC3_POSITION                         0x3
#define _LCDVCON2_LCDVSRC3_SIZE                             0x1
#define _LCDVCON2_LCDVSRC3_LENGTH                           0x1
#define _LCDVCON2_LCDVSRC3_MASK                             0x8

// Register: LCDREF
#define LCDREF LCDREF
extern volatile unsigned char           LCDREF              __at(0x1D16);
#ifndef _LIB_BUILD
asm("LCDREF equ 01D16h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LCDCST                 :3;
    };
    struct {
        unsigned LCDCST0                :1;
        unsigned LCDCST1                :1;
        unsigned LCDCST2                :1;
    };
} LCDREFbits_t;
extern volatile LCDREFbits_t LCDREFbits __at(0x1D16);
// bitfield macros
#define _LCDREF_LCDCST_POSN                                 0x0
#define _LCDREF_LCDCST_POSITION                             0x0
#define _LCDREF_LCDCST_SIZE                                 0x3
#define _LCDREF_LCDCST_LENGTH                               0x3
#define _LCDREF_LCDCST_MASK                                 0x7
#define _LCDREF_LCDCST0_POSN                                0x0
#define _LCDREF_LCDCST0_POSITION                            0x0
#define _LCDREF_LCDCST0_SIZE                                0x1
#define _LCDREF_LCDCST0_LENGTH                              0x1
#define _LCDREF_LCDCST0_MASK                                0x1
#define _LCDREF_LCDCST1_POSN                                0x1
#define _LCDREF_LCDCST1_POSITION                            0x1
#define _LCDREF_LCDCST1_SIZE                                0x1
#define _LCDREF_LCDCST1_LENGTH                              0x1
#define _LCDREF_LCDCST1_MASK                                0x2
#define _LCDREF_LCDCST2_POSN                                0x2
#define _LCDREF_LCDCST2_POSITION                            0x2
#define _LCDREF_LCDCST2_SIZE                                0x1
#define _LCDREF_LCDCST2_LENGTH                              0x1
#define _LCDREF_LCDCST2_MASK                                0x4

// Register: LCDRL
#define LCDRL LCDRL
extern volatile unsigned char           LCDRL               __at(0x1D17);
#ifndef _LIB_BUILD
asm("LCDRL equ 01D17h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LRLAT                  :3;
        unsigned LCDIRI                 :1;
        unsigned LRLBP                  :2;
        unsigned LRLAP                  :2;
    };
    struct {
        unsigned LRLAT0                 :1;
        unsigned LRLAT1                 :1;
        unsigned LRLAT2                 :1;
        unsigned                        :1;
        unsigned LRLBP0                 :1;
        unsigned LRLBP1                 :1;
        unsigned LRLAP0                 :1;
        unsigned LRLAP1                 :1;
    };
} LCDRLbits_t;
extern volatile LCDRLbits_t LCDRLbits __at(0x1D17);
// bitfield macros
#define _LCDRL_LRLAT_POSN                                   0x0
#define _LCDRL_LRLAT_POSITION                               0x0
#define _LCDRL_LRLAT_SIZE                                   0x3
#define _LCDRL_LRLAT_LENGTH                                 0x3
#define _LCDRL_LRLAT_MASK                                   0x7
#define _LCDRL_LCDIRI_POSN                                  0x3
#define _LCDRL_LCDIRI_POSITION                              0x3
#define _LCDRL_LCDIRI_SIZE                                  0x1
#define _LCDRL_LCDIRI_LENGTH                                0x1
#define _LCDRL_LCDIRI_MASK                                  0x8
#define _LCDRL_LRLBP_POSN                                   0x4
#define _LCDRL_LRLBP_POSITION                               0x4
#define _LCDRL_LRLBP_SIZE                                   0x2
#define _LCDRL_LRLBP_LENGTH                                 0x2
#define _LCDRL_LRLBP_MASK                                   0x30
#define _LCDRL_LRLAP_POSN                                   0x6
#define _LCDRL_LRLAP_POSITION                               0x6
#define _LCDRL_LRLAP_SIZE                                   0x2
#define _LCDRL_LRLAP_LENGTH                                 0x2
#define _LCDRL_LRLAP_MASK                                   0xC0
#define _LCDRL_LRLAT0_POSN                                  0x0
#define _LCDRL_LRLAT0_POSITION                              0x0
#define _LCDRL_LRLAT0_SIZE                                  0x1
#define _LCDRL_LRLAT0_LENGTH                                0x1
#define _LCDRL_LRLAT0_MASK                                  0x1
#define _LCDRL_LRLAT1_POSN                                  0x1
#define _LCDRL_LRLAT1_POSITION                              0x1
#define _LCDRL_LRLAT1_SIZE                                  0x1
#define _LCDRL_LRLAT1_LENGTH                                0x1
#define _LCDRL_LRLAT1_MASK                                  0x2
#define _LCDRL_LRLAT2_POSN                                  0x2
#define _LCDRL_LRLAT2_POSITION                              0x2
#define _LCDRL_LRLAT2_SIZE                                  0x1
#define _LCDRL_LRLAT2_LENGTH                                0x1
#define _LCDRL_LRLAT2_MASK                                  0x4
#define _LCDRL_LRLBP0_POSN                                  0x4
#define _LCDRL_LRLBP0_POSITION                              0x4
#define _LCDRL_LRLBP0_SIZE                                  0x1
#define _LCDRL_LRLBP0_LENGTH                                0x1
#define _LCDRL_LRLBP0_MASK                                  0x10
#define _LCDRL_LRLBP1_POSN                                  0x5
#define _LCDRL_LRLBP1_POSITION                              0x5
#define _LCDRL_LRLBP1_SIZE                                  0x1
#define _LCDRL_LRLBP1_LENGTH                                0x1
#define _LCDRL_LRLBP1_MASK                                  0x20
#define _LCDRL_LRLAP0_POSN                                  0x6
#define _LCDRL_LRLAP0_POSITION                              0x6
#define _LCDRL_LRLAP0_SIZE                                  0x1
#define _LCDRL_LRLAP0_LENGTH                                0x1
#define _LCDRL_LRLAP0_MASK                                  0x40
#define _LCDRL_LRLAP1_POSN                                  0x7
#define _LCDRL_LRLAP1_POSITION                              0x7
#define _LCDRL_LRLAP1_SIZE                                  0x1
#define _LCDRL_LRLAP1_LENGTH                                0x1
#define _LCDRL_LRLAP1_MASK                                  0x80

// Register: LCDDATA0
#define LCDDATA0 LCDDATA0
extern volatile unsigned char           LCDDATA0            __at(0x1D18);
#ifndef _LIB_BUILD
asm("LCDDATA0 equ 01D18h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S00C0                  :1;
        unsigned S01C0                  :1;
        unsigned S02C0                  :1;
        unsigned S03C0                  :1;
        unsigned S04C0                  :1;
        unsigned                        :1;
        unsigned S06C0                  :1;
        unsigned S07C0                  :1;
    };
} LCDDATA0bits_t;
extern volatile LCDDATA0bits_t LCDDATA0bits __at(0x1D18);
// bitfield macros
#define _LCDDATA0_S00C0_POSN                                0x0
#define _LCDDATA0_S00C0_POSITION                            0x0
#define _LCDDATA0_S00C0_SIZE                                0x1
#define _LCDDATA0_S00C0_LENGTH                              0x1
#define _LCDDATA0_S00C0_MASK                                0x1
#define _LCDDATA0_S01C0_POSN                                0x1
#define _LCDDATA0_S01C0_POSITION                            0x1
#define _LCDDATA0_S01C0_SIZE                                0x1
#define _LCDDATA0_S01C0_LENGTH                              0x1
#define _LCDDATA0_S01C0_MASK                                0x2
#define _LCDDATA0_S02C0_POSN                                0x2
#define _LCDDATA0_S02C0_POSITION                            0x2
#define _LCDDATA0_S02C0_SIZE                                0x1
#define _LCDDATA0_S02C0_LENGTH                              0x1
#define _LCDDATA0_S02C0_MASK                                0x4
#define _LCDDATA0_S03C0_POSN                                0x3
#define _LCDDATA0_S03C0_POSITION                            0x3
#define _LCDDATA0_S03C0_SIZE                                0x1
#define _LCDDATA0_S03C0_LENGTH                              0x1
#define _LCDDATA0_S03C0_MASK                                0x8
#define _LCDDATA0_S04C0_POSN                                0x4
#define _LCDDATA0_S04C0_POSITION                            0x4
#define _LCDDATA0_S04C0_SIZE                                0x1
#define _LCDDATA0_S04C0_LENGTH                              0x1
#define _LCDDATA0_S04C0_MASK                                0x10
#define _LCDDATA0_S06C0_POSN                                0x6
#define _LCDDATA0_S06C0_POSITION                            0x6
#define _LCDDATA0_S06C0_SIZE                                0x1
#define _LCDDATA0_S06C0_LENGTH                              0x1
#define _LCDDATA0_S06C0_MASK                                0x40
#define _LCDDATA0_S07C0_POSN                                0x7
#define _LCDDATA0_S07C0_POSITION                            0x7
#define _LCDDATA0_S07C0_SIZE                                0x1
#define _LCDDATA0_S07C0_LENGTH                              0x1
#define _LCDDATA0_S07C0_MASK                                0x80

// Register: LCDDATA1
#define LCDDATA1 LCDDATA1
extern volatile unsigned char           LCDDATA1            __at(0x1D19);
#ifndef _LIB_BUILD
asm("LCDDATA1 equ 01D19h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S08C0                  :1;
        unsigned S09C0                  :1;
        unsigned S10C0                  :1;
        unsigned S11C0                  :1;
        unsigned                        :1;
        unsigned S13C0                  :1;
        unsigned S14C0                  :1;
        unsigned S15C0                  :1;
    };
} LCDDATA1bits_t;
extern volatile LCDDATA1bits_t LCDDATA1bits __at(0x1D19);
// bitfield macros
#define _LCDDATA1_S08C0_POSN                                0x0
#define _LCDDATA1_S08C0_POSITION                            0x0
#define _LCDDATA1_S08C0_SIZE                                0x1
#define _LCDDATA1_S08C0_LENGTH                              0x1
#define _LCDDATA1_S08C0_MASK                                0x1
#define _LCDDATA1_S09C0_POSN                                0x1
#define _LCDDATA1_S09C0_POSITION                            0x1
#define _LCDDATA1_S09C0_SIZE                                0x1
#define _LCDDATA1_S09C0_LENGTH                              0x1
#define _LCDDATA1_S09C0_MASK                                0x2
#define _LCDDATA1_S10C0_POSN                                0x2
#define _LCDDATA1_S10C0_POSITION                            0x2
#define _LCDDATA1_S10C0_SIZE                                0x1
#define _LCDDATA1_S10C0_LENGTH                              0x1
#define _LCDDATA1_S10C0_MASK                                0x4
#define _LCDDATA1_S11C0_POSN                                0x3
#define _LCDDATA1_S11C0_POSITION                            0x3
#define _LCDDATA1_S11C0_SIZE                                0x1
#define _LCDDATA1_S11C0_LENGTH                              0x1
#define _LCDDATA1_S11C0_MASK                                0x8
#define _LCDDATA1_S13C0_POSN                                0x5
#define _LCDDATA1_S13C0_POSITION                            0x5
#define _LCDDATA1_S13C0_SIZE                                0x1
#define _LCDDATA1_S13C0_LENGTH                              0x1
#define _LCDDATA1_S13C0_MASK                                0x20
#define _LCDDATA1_S14C0_POSN                                0x6
#define _LCDDATA1_S14C0_POSITION                            0x6
#define _LCDDATA1_S14C0_SIZE                                0x1
#define _LCDDATA1_S14C0_LENGTH                              0x1
#define _LCDDATA1_S14C0_MASK                                0x40
#define _LCDDATA1_S15C0_POSN                                0x7
#define _LCDDATA1_S15C0_POSITION                            0x7
#define _LCDDATA1_S15C0_SIZE                                0x1
#define _LCDDATA1_S15C0_LENGTH                              0x1
#define _LCDDATA1_S15C0_MASK                                0x80

// Register: LCDDATA2
#define LCDDATA2 LCDDATA2
extern volatile unsigned char           LCDDATA2            __at(0x1D1A);
#ifndef _LIB_BUILD
asm("LCDDATA2 equ 01D1Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned S18C0                  :1;
        unsigned S19C0                  :1;
        unsigned S20C0                  :1;
        unsigned                        :1;
        unsigned S22C0                  :1;
        unsigned S23C0                  :1;
    };
} LCDDATA2bits_t;
