MikroElektronika/core_packages/PIC/XC8/def/PIC16F19175/mcu.h
// Register: RD5PPS
#define RD5PPS RD5PPS
extern volatile unsigned char           RD5PPS              __at(0x1F2D);
#ifndef _LIB_BUILD
asm("RD5PPS equ 01F2Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RD5PPS                 :5;
    };
} RD5PPSbits_t;
extern volatile RD5PPSbits_t RD5PPSbits __at(0x1F2D);
// bitfield macros
#define _RD5PPS_RD5PPS_POSN                                 0x0
#define _RD5PPS_RD5PPS_POSITION                             0x0
#define _RD5PPS_RD5PPS_SIZE                                 0x5
#define _RD5PPS_RD5PPS_LENGTH                               0x5
#define _RD5PPS_RD5PPS_MASK                                 0x1F

// Register: RD6PPS
#define RD6PPS RD6PPS
extern volatile unsigned char           RD6PPS              __at(0x1F2E);
#ifndef _LIB_BUILD
asm("RD6PPS equ 01F2Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RD6PPS                 :5;
    };
} RD6PPSbits_t;
extern volatile RD6PPSbits_t RD6PPSbits __at(0x1F2E);
// bitfield macros
#define _RD6PPS_RD6PPS_POSN                                 0x0
#define _RD6PPS_RD6PPS_POSITION                             0x0
#define _RD6PPS_RD6PPS_SIZE                                 0x5
#define _RD6PPS_RD6PPS_LENGTH                               0x5
#define _RD6PPS_RD6PPS_MASK                                 0x1F

// Register: RD7PPS
#define RD7PPS RD7PPS
extern volatile unsigned char           RD7PPS              __at(0x1F2F);
#ifndef _LIB_BUILD
asm("RD7PPS equ 01F2Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RD7PPS                 :5;
    };
} RD7PPSbits_t;
extern volatile RD7PPSbits_t RD7PPSbits __at(0x1F2F);
// bitfield macros
#define _RD7PPS_RD7PPS_POSN                                 0x0
#define _RD7PPS_RD7PPS_POSITION                             0x0
#define _RD7PPS_RD7PPS_SIZE                                 0x5
#define _RD7PPS_RD7PPS_LENGTH                               0x5
#define _RD7PPS_RD7PPS_MASK                                 0x1F

// Register: RE0PPS
#define RE0PPS RE0PPS
extern volatile unsigned char           RE0PPS              __at(0x1F30);
#ifndef _LIB_BUILD
asm("RE0PPS equ 01F30h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RE0PPS                 :5;
    };
} RE0PPSbits_t;
extern volatile RE0PPSbits_t RE0PPSbits __at(0x1F30);
// bitfield macros
#define _RE0PPS_RE0PPS_POSN                                 0x0
#define _RE0PPS_RE0PPS_POSITION                             0x0
#define _RE0PPS_RE0PPS_SIZE                                 0x5
#define _RE0PPS_RE0PPS_LENGTH                               0x5
#define _RE0PPS_RE0PPS_MASK                                 0x1F

// Register: RE1PPS
#define RE1PPS RE1PPS
extern volatile unsigned char           RE1PPS              __at(0x1F31);
#ifndef _LIB_BUILD
asm("RE1PPS equ 01F31h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RE1PPS                 :5;
    };
} RE1PPSbits_t;
extern volatile RE1PPSbits_t RE1PPSbits __at(0x1F31);
// bitfield macros
#define _RE1PPS_RE1PPS_POSN                                 0x0
#define _RE1PPS_RE1PPS_POSITION                             0x0
#define _RE1PPS_RE1PPS_SIZE                                 0x5
#define _RE1PPS_RE1PPS_LENGTH                               0x5
#define _RE1PPS_RE1PPS_MASK                                 0x1F

// Register: RE2PPS
#define RE2PPS RE2PPS
extern volatile unsigned char           RE2PPS              __at(0x1F32);
#ifndef _LIB_BUILD
asm("RE2PPS equ 01F32h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RE2PPS                 :5;
    };
} RE2PPSbits_t;
extern volatile RE2PPSbits_t RE2PPSbits __at(0x1F32);
// bitfield macros
#define _RE2PPS_RE2PPS_POSN                                 0x0
#define _RE2PPS_RE2PPS_POSITION                             0x0
#define _RE2PPS_RE2PPS_SIZE                                 0x5
#define _RE2PPS_RE2PPS_LENGTH                               0x5
#define _RE2PPS_RE2PPS_MASK                                 0x1F

// Register: ANSELA
#define ANSELA ANSELA
extern volatile unsigned char           ANSELA              __at(0x1F38);
#ifndef _LIB_BUILD
asm("ANSELA equ 01F38h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ANSA0                  :1;
        unsigned ANSA1                  :1;
        unsigned ANSA2                  :1;
        unsigned ANSA3                  :1;
        unsigned ANSA4                  :1;
        unsigned                        :1;
        unsigned ANSA6                  :1;
        unsigned ANSA7                  :1;
    };
} ANSELAbits_t;
extern volatile ANSELAbits_t ANSELAbits __at(0x1F38);
// bitfield macros
#define _ANSELA_ANSA0_POSN                                  0x0
#define _ANSELA_ANSA0_POSITION                              0x0
#define _ANSELA_ANSA0_SIZE                                  0x1
#define _ANSELA_ANSA0_LENGTH                                0x1
#define _ANSELA_ANSA0_MASK                                  0x1
#define _ANSELA_ANSA1_POSN                                  0x1
#define _ANSELA_ANSA1_POSITION                              0x1
#define _ANSELA_ANSA1_SIZE                                  0x1
#define _ANSELA_ANSA1_LENGTH                                0x1
#define _ANSELA_ANSA1_MASK                                  0x2
#define _ANSELA_ANSA2_POSN                                  0x2
#define _ANSELA_ANSA2_POSITION                              0x2
#define _ANSELA_ANSA2_SIZE                                  0x1
#define _ANSELA_ANSA2_LENGTH                                0x1
#define _ANSELA_ANSA2_MASK                                  0x4
#define _ANSELA_ANSA3_POSN                                  0x3
#define _ANSELA_ANSA3_POSITION                              0x3
#define _ANSELA_ANSA3_SIZE                                  0x1
#define _ANSELA_ANSA3_LENGTH                                0x1
#define _ANSELA_ANSA3_MASK                                  0x8
#define _ANSELA_ANSA4_POSN                                  0x4
#define _ANSELA_ANSA4_POSITION                              0x4
#define _ANSELA_ANSA4_SIZE                                  0x1
#define _ANSELA_ANSA4_LENGTH                                0x1
#define _ANSELA_ANSA4_MASK                                  0x10
#define _ANSELA_ANSA6_POSN                                  0x6
#define _ANSELA_ANSA6_POSITION                              0x6
#define _ANSELA_ANSA6_SIZE                                  0x1
#define _ANSELA_ANSA6_LENGTH                                0x1
#define _ANSELA_ANSA6_MASK                                  0x40
#define _ANSELA_ANSA7_POSN                                  0x7
#define _ANSELA_ANSA7_POSITION                              0x7
#define _ANSELA_ANSA7_SIZE                                  0x1
#define _ANSELA_ANSA7_LENGTH                                0x1
#define _ANSELA_ANSA7_MASK                                  0x80

