MikroElektronika/core_packages/PIC/XC8/def/PIC16F19175/mcu.h
extern volatile __bit                   TMR1H0              __at(0x1068);	// @ (0x20D * 8 + 0)
#define                                 TMR1H0_bit          _BIT_ACCESS(TMR1H,0)
// TMR1H<TMR1H1>
extern volatile __bit                   TMR1H1              __at(0x1069);	// @ (0x20D * 8 + 1)
#define                                 TMR1H1_bit          _BIT_ACCESS(TMR1H,1)
// TMR1H<TMR1H2>
extern volatile __bit                   TMR1H2              __at(0x106A);	// @ (0x20D * 8 + 2)
#define                                 TMR1H2_bit          _BIT_ACCESS(TMR1H,2)
// TMR1H<TMR1H3>
extern volatile __bit                   TMR1H3              __at(0x106B);	// @ (0x20D * 8 + 3)
#define                                 TMR1H3_bit          _BIT_ACCESS(TMR1H,3)
// TMR1H<TMR1H4>
extern volatile __bit                   TMR1H4              __at(0x106C);	// @ (0x20D * 8 + 4)
#define                                 TMR1H4_bit          _BIT_ACCESS(TMR1H,4)
// TMR1H<TMR1H5>
extern volatile __bit                   TMR1H5              __at(0x106D);	// @ (0x20D * 8 + 5)
#define                                 TMR1H5_bit          _BIT_ACCESS(TMR1H,5)
// TMR1H<TMR1H6>
extern volatile __bit                   TMR1H6              __at(0x106E);	// @ (0x20D * 8 + 6)
#define                                 TMR1H6_bit          _BIT_ACCESS(TMR1H,6)
// TMR1H<TMR1H7>
extern volatile __bit                   TMR1H7              __at(0x106F);	// @ (0x20D * 8 + 7)
#define                                 TMR1H7_bit          _BIT_ACCESS(TMR1H,7)
// PIE4<TMR1IE>
extern volatile __bit                   TMR1IE              __at(0x38D0);	// @ (0x71A * 8 + 0)
#define                                 TMR1IE_bit          _BIT_ACCESS(PIE4,0)
// PIR4<TMR1IF>
extern volatile __bit                   TMR1IF              __at(0x3880);	// @ (0x710 * 8 + 0)
#define                                 TMR1IF_bit          _BIT_ACCESS(PIR4,0)
// TMR1L<TMR1L0>
extern volatile __bit                   TMR1L0              __at(0x1060);	// @ (0x20C * 8 + 0)
#define                                 TMR1L0_bit          _BIT_ACCESS(TMR1L,0)
// TMR1L<TMR1L1>
extern volatile __bit                   TMR1L1              __at(0x1061);	// @ (0x20C * 8 + 1)
#define                                 TMR1L1_bit          _BIT_ACCESS(TMR1L,1)
// TMR1L<TMR1L2>
extern volatile __bit                   TMR1L2              __at(0x1062);	// @ (0x20C * 8 + 2)
#define                                 TMR1L2_bit          _BIT_ACCESS(TMR1L,2)
// TMR1L<TMR1L3>
extern volatile __bit                   TMR1L3              __at(0x1063);	// @ (0x20C * 8 + 3)
#define                                 TMR1L3_bit          _BIT_ACCESS(TMR1L,3)
// TMR1L<TMR1L4>
extern volatile __bit                   TMR1L4              __at(0x1064);	// @ (0x20C * 8 + 4)
#define                                 TMR1L4_bit          _BIT_ACCESS(TMR1L,4)
// TMR1L<TMR1L5>
extern volatile __bit                   TMR1L5              __at(0x1065);	// @ (0x20C * 8 + 5)
#define                                 TMR1L5_bit          _BIT_ACCESS(TMR1L,5)
// TMR1L<TMR1L6>
extern volatile __bit                   TMR1L6              __at(0x1066);	// @ (0x20C * 8 + 6)
#define                                 TMR1L6_bit          _BIT_ACCESS(TMR1L,6)
// TMR1L<TMR1L7>
extern volatile __bit                   TMR1L7              __at(0x1067);	// @ (0x20C * 8 + 7)
#define                                 TMR1L7_bit          _BIT_ACCESS(TMR1L,7)
// PMD1<TMR1MD>
extern volatile __bit                   TMR1MD              __at(0x3CB9);	// @ (0x797 * 8 + 1)
#define                                 TMR1MD_bit          _BIT_ACCESS(PMD1,1)
// T1CON<TMR1ON>
extern volatile __bit                   TMR1ON              __at(0x1070);	// @ (0x20E * 8 + 0)
#define                                 TMR1ON_bit          _BIT_ACCESS(T1CON,0)
// PIE4<TMR2IE>
extern volatile __bit                   TMR2IE              __at(0x38D1);	// @ (0x71A * 8 + 1)
#define                                 TMR2IE_bit          _BIT_ACCESS(PIE4,1)
// PIR4<TMR2IF>
extern volatile __bit                   TMR2IF              __at(0x3881);	// @ (0x710 * 8 + 1)
#define                                 TMR2IF_bit          _BIT_ACCESS(PIR4,1)
// PMD1<TMR2MD>
extern volatile __bit                   TMR2MD              __at(0x3CBA);	// @ (0x797 * 8 + 2)
#define                                 TMR2MD_bit          _BIT_ACCESS(PMD1,2)
// T2CON<TMR2ON>
extern volatile __bit                   TMR2ON              __at(0x1477);	// @ (0x28E * 8 + 7)
#define                                 TMR2ON_bit          _BIT_ACCESS(T2CON,7)
// PIE4<TMR4IE>
extern volatile __bit                   TMR4IE              __at(0x38D3);	// @ (0x71A * 8 + 3)
#define                                 TMR4IE_bit          _BIT_ACCESS(PIE4,3)
// PIR4<TMR4IF>
extern volatile __bit                   TMR4IF              __at(0x3883);	// @ (0x710 * 8 + 3)
#define                                 TMR4IF_bit          _BIT_ACCESS(PIR4,3)
// PMD1<TMR4MD>
extern volatile __bit                   TMR4MD              __at(0x3CBC);	// @ (0x797 * 8 + 4)
#define                                 TMR4MD_bit          _BIT_ACCESS(PMD1,4)
// T4CON<TMR4ON>
extern volatile __bit                   TMR4ON              __at(0x14A7);	// @ (0x294 * 8 + 7)
#define                                 TMR4ON_bit          _BIT_ACCESS(T4CON,7)
// TRISA<TRISA0>
extern volatile __bit                   TRISA0              __at(0x90);	// @ (0x12 * 8 + 0)
#define                                 TRISA0_bit          _BIT_ACCESS(TRISA,0)
// TRISA<TRISA1>
extern volatile __bit                   TRISA1              __at(0x91);	// @ (0x12 * 8 + 1)
#define                                 TRISA1_bit          _BIT_ACCESS(TRISA,1)
// TRISA<TRISA2>
extern volatile __bit                   TRISA2              __at(0x92);	// @ (0x12 * 8 + 2)
#define                                 TRISA2_bit          _BIT_ACCESS(TRISA,2)
// TRISA<TRISA3>
extern volatile __bit                   TRISA3              __at(0x93);	// @ (0x12 * 8 + 3)
#define                                 TRISA3_bit          _BIT_ACCESS(TRISA,3)
// TRISA<TRISA4>
extern volatile __bit                   TRISA4              __at(0x94);	// @ (0x12 * 8 + 4)
#define                                 TRISA4_bit          _BIT_ACCESS(TRISA,4)
// TRISA<TRISA5>
extern volatile __bit                   TRISA5              __at(0x95);	// @ (0x12 * 8 + 5)
#define                                 TRISA5_bit          _BIT_ACCESS(TRISA,5)
// TRISA<TRISA6>
extern volatile __bit                   TRISA6              __at(0x96);	// @ (0x12 * 8 + 6)
#define                                 TRISA6_bit          _BIT_ACCESS(TRISA,6)
// TRISA<TRISA7>
extern volatile __bit                   TRISA7              __at(0x97);	// @ (0x12 * 8 + 7)
#define                                 TRISA7_bit          _BIT_ACCESS(TRISA,7)
// TRISB<TRISB0>
extern volatile __bit                   TRISB0              __at(0x98);	// @ (0x13 * 8 + 0)
#define                                 TRISB0_bit          _BIT_ACCESS(TRISB,0)
// TRISB<TRISB1>
extern volatile __bit                   TRISB1              __at(0x99);	// @ (0x13 * 8 + 1)
#define                                 TRISB1_bit          _BIT_ACCESS(TRISB,1)
// TRISB<TRISB2>
extern volatile __bit                   TRISB2              __at(0x9A);	// @ (0x13 * 8 + 2)
#define                                 TRISB2_bit          _BIT_ACCESS(TRISB,2)
// TRISB<TRISB3>
extern volatile __bit                   TRISB3              __at(0x9B);	// @ (0x13 * 8 + 3)
#define                                 TRISB3_bit          _BIT_ACCESS(TRISB,3)
// TRISB<TRISB4>
extern volatile __bit                   TRISB4              __at(0x9C);	// @ (0x13 * 8 + 4)
#define                                 TRISB4_bit          _BIT_ACCESS(TRISB,4)
// TRISB<TRISB5>
extern volatile __bit                   TRISB5              __at(0x9D);	// @ (0x13 * 8 + 5)
#define                                 TRISB5_bit          _BIT_ACCESS(TRISB,5)
// TRISB<TRISB6>
extern volatile __bit                   TRISB6              __at(0x9E);	// @ (0x13 * 8 + 6)
#define                                 TRISB6_bit          _BIT_ACCESS(TRISB,6)
// TRISB<TRISB7>
extern volatile __bit                   TRISB7              __at(0x9F);	// @ (0x13 * 8 + 7)
#define                                 TRISB7_bit          _BIT_ACCESS(TRISB,7)
// TRISC<TRISC0>
extern volatile __bit                   TRISC0              __at(0xA0);	// @ (0x14 * 8 + 0)
#define                                 TRISC0_bit          _BIT_ACCESS(TRISC,0)
// TRISC<TRISC1>
extern volatile __bit                   TRISC1              __at(0xA1);	// @ (0x14 * 8 + 1)
#define                                 TRISC1_bit          _BIT_ACCESS(TRISC,1)
// TRISC<TRISC2>
extern volatile __bit                   TRISC2              __at(0xA2);	// @ (0x14 * 8 + 2)
#define                                 TRISC2_bit          _BIT_ACCESS(TRISC,2)
// TRISC<TRISC3>
extern volatile __bit                   TRISC3              __at(0xA3);	// @ (0x14 * 8 + 3)
#define                                 TRISC3_bit          _BIT_ACCESS(TRISC,3)
// TRISC<TRISC4>
extern volatile __bit                   TRISC4              __at(0xA4);	// @ (0x14 * 8 + 4)
#define                                 TRISC4_bit          _BIT_ACCESS(TRISC,4)
// TRISC<TRISC6>
extern volatile __bit                   TRISC6              __at(0xA6);	// @ (0x14 * 8 + 6)
#define                                 TRISC6_bit          _BIT_ACCESS(TRISC,6)
// TRISC<TRISC7>
extern volatile __bit                   TRISC7              __at(0xA7);	// @ (0x14 * 8 + 7)
#define                                 TRISC7_bit          _BIT_ACCESS(TRISC,7)
// TRISD<TRISD0>
extern volatile __bit                   TRISD0              __at(0xA8);	// @ (0x15 * 8 + 0)
#define                                 TRISD0_bit          _BIT_ACCESS(TRISD,0)
// TRISD<TRISD1>
extern volatile __bit                   TRISD1              __at(0xA9);	// @ (0x15 * 8 + 1)
#define                                 TRISD1_bit          _BIT_ACCESS(TRISD,1)
// TRISD<TRISD2>
extern volatile __bit                   TRISD2              __at(0xAA);	// @ (0x15 * 8 + 2)
#define                                 TRISD2_bit          _BIT_ACCESS(TRISD,2)
// TRISD<TRISD3>
extern volatile __bit                   TRISD3              __at(0xAB);	// @ (0x15 * 8 + 3)
#define                                 TRISD3_bit          _BIT_ACCESS(TRISD,3)
// TRISD<TRISD4>
extern volatile __bit                   TRISD4              __at(0xAC);	// @ (0x15 * 8 + 4)
#define                                 TRISD4_bit          _BIT_ACCESS(TRISD,4)
// TRISD<TRISD5>
extern volatile __bit                   TRISD5              __at(0xAD);	// @ (0x15 * 8 + 5)
#define                                 TRISD5_bit          _BIT_ACCESS(TRISD,5)
// TRISD<TRISD6>
extern volatile __bit                   TRISD6              __at(0xAE);	// @ (0x15 * 8 + 6)
#define                                 TRISD6_bit          _BIT_ACCESS(TRISD,6)
// TRISD<TRISD7>
extern volatile __bit                   TRISD7              __at(0xAF);	// @ (0x15 * 8 + 7)
#define                                 TRISD7_bit          _BIT_ACCESS(TRISD,7)
// TRISE<TRISE0>
extern volatile __bit                   TRISE0              __at(0xB0);	// @ (0x16 * 8 + 0)
#define                                 TRISE0_bit          _BIT_ACCESS(TRISE,0)
// TRISE<TRISE1>
extern volatile __bit                   TRISE1              __at(0xB1);	// @ (0x16 * 8 + 1)
#define                                 TRISE1_bit          _BIT_ACCESS(TRISE,1)
// TRISE<TRISE2>
extern volatile __bit                   TRISE2              __at(0xB2);	// @ (0x16 * 8 + 2)
#define                                 TRISE2_bit          _BIT_ACCESS(TRISE,2)
// SMT1STAT<TS>
extern volatile __bit                   TS                  __at(0x24D2);	// @ (0x49A * 8 + 2)
#define                                 TS_bit              _BIT_ACCESS(SMT1STAT,2)
// FVRCON<TSEN>
extern volatile __bit                   TSEN                __at(0x4865);	// @ (0x90C * 8 + 5)
#define                                 TSEN_bit            _BIT_ACCESS(FVRCON,5)
// FVRCON<TSRNG>
extern volatile __bit                   TSRNG               __at(0x4864);	// @ (0x90C * 8 + 4)
#define                                 TSRNG_bit           _BIT_ACCESS(FVRCON,4)
// PIE3<TX1IE>
extern volatile __bit                   TX1IE               __at(0x38CC);	// @ (0x719 * 8 + 4)
#define                                 TX1IE_bit           _BIT_ACCESS(PIE3,4)
// PIR3<TX1IF>
extern volatile __bit                   TX1IF               __at(0x387C);	// @ (0x70F * 8 + 4)
#define                                 TX1IF_bit           _BIT_ACCESS(PIR3,4)
// TX1PPS<TX1PPS0>
extern volatile __bit                   TX1PPS0             __at(0xF660);	// @ (0x1ECC * 8 + 0)
#define                                 TX1PPS0_bit         _BIT_ACCESS(TX1PPS,0)
// TX1PPS<TX1PPS1>
extern volatile __bit                   TX1PPS1             __at(0xF661);	// @ (0x1ECC * 8 + 1)
#define                                 TX1PPS1_bit         _BIT_ACCESS(TX1PPS,1)
// TX1PPS<TX1PPS2>
extern volatile __bit                   TX1PPS2             __at(0xF662);	// @ (0x1ECC * 8 + 2)
#define                                 TX1PPS2_bit         _BIT_ACCESS(TX1PPS,2)
// TX1PPS<TX1PPS3>
extern volatile __bit                   TX1PPS3             __at(0xF663);	// @ (0x1ECC * 8 + 3)
#define                                 TX1PPS3_bit         _BIT_ACCESS(TX1PPS,3)
// TX1PPS<TX1PPS4>
extern volatile __bit                   TX1PPS4             __at(0xF664);	// @ (0x1ECC * 8 + 4)
#define                                 TX1PPS4_bit         _BIT_ACCESS(TX1PPS,4)
// PIE3<TX2IE>
extern volatile __bit                   TX2IE               __at(0x38CE);	// @ (0x719 * 8 + 6)
#define                                 TX2IE_bit           _BIT_ACCESS(PIE3,6)
// PIR3<TX2IF>
extern volatile __bit                   TX2IF               __at(0x387E);	// @ (0x70F * 8 + 6)
#define                                 TX2IF_bit           _BIT_ACCESS(PIR3,6)
// TX2PPS<TX2PPS0>
extern volatile __bit                   TX2PPS0             __at(0xF670);	// @ (0x1ECE * 8 + 0)
#define                                 TX2PPS0_bit         _BIT_ACCESS(TX2PPS,0)
// TX2PPS<TX2PPS1>
extern volatile __bit                   TX2PPS1             __at(0xF671);	// @ (0x1ECE * 8 + 1)
#define                                 TX2PPS1_bit         _BIT_ACCESS(TX2PPS,1)
// TX2PPS<TX2PPS2>
extern volatile __bit                   TX2PPS2             __at(0xF672);	// @ (0x1ECE * 8 + 2)
#define                                 TX2PPS2_bit         _BIT_ACCESS(TX2PPS,2)
// TX2PPS<TX2PPS3>
extern volatile __bit                   TX2PPS3             __at(0xF673);	// @ (0x1ECE * 8 + 3)
#define                                 TX2PPS3_bit         _BIT_ACCESS(TX2PPS,3)
// TX2PPS<TX2PPS4>
extern volatile __bit                   TX2PPS4             __at(0xF674);	// @ (0x1ECE * 8 + 4)
#define                                 TX2PPS4_bit         _BIT_ACCESS(TX2PPS,4)
// SSP1STAT<UA>
extern volatile __bit                   UA                  __at(0xC79);	// @ (0x18F * 8 + 1)
#define                                 UA_bit              _BIT_ACCESS(SSP1STAT,1)
// SSP1STAT<UA1>
extern volatile __bit                   UA1                 __at(0xC79);	// @ (0x18F * 8 + 1)
#define                                 UA1_bit             _BIT_ACCESS(SSP1STAT,1)
// PMD4<UART1MD>
extern volatile __bit                   UART1MD             __at(0x3CD6);	// @ (0x79A * 8 + 6)
#define                                 UART1MD_bit         _BIT_ACCESS(PMD4,6)
// PMD4<UART2MD>
extern volatile __bit                   UART2MD             __at(0x3CD7);	// @ (0x79A * 8 + 7)
#define                                 UART2MD_bit         _BIT_ACCESS(PMD4,7)
// ADUTHL<UTH0>
extern volatile __bit                   UTH0                __at(0x470);	// @ (0x8E * 8 + 0)
#define                                 UTH0_bit            _BIT_ACCESS(ADUTHL,0)
// ADUTHL<UTH1>
extern volatile __bit                   UTH1                __at(0x471);	// @ (0x8E * 8 + 1)
#define                                 UTH1_bit            _BIT_ACCESS(ADUTHL,1)
// ADUTHH<UTH10>
extern volatile __bit                   UTH10               __at(0x47A);	// @ (0x8F * 8 + 2)
#define                                 UTH10_bit           _BIT_ACCESS(ADUTHH,2)
// ADUTHH<UTH11>
extern volatile __bit                   UTH11               __at(0x47B);	// @ (0x8F * 8 + 3)
#define                                 UTH11_bit           _BIT_ACCESS(ADUTHH,3)
// ADUTHH<UTH12>
extern volatile __bit                   UTH12               __at(0x47C);	// @ (0x8F * 8 + 4)
#define                                 UTH12_bit           _BIT_ACCESS(ADUTHH,4)
// ADUTHH<UTH13>
extern volatile __bit                   UTH13               __at(0x47D);	// @ (0x8F * 8 + 5)
#define                                 UTH13_bit           _BIT_ACCESS(ADUTHH,5)
// ADUTHH<UTH14>
extern volatile __bit                   UTH14               __at(0x47E);	// @ (0x8F * 8 + 6)
#define                                 UTH14_bit           _BIT_ACCESS(ADUTHH,6)
// ADUTHH<UTH15>
extern volatile __bit                   UTH15               __at(0x47F);	// @ (0x8F * 8 + 7)
#define                                 UTH15_bit           _BIT_ACCESS(ADUTHH,7)
// ADUTHL<UTH2>
extern volatile __bit                   UTH2                __at(0x472);	// @ (0x8E * 8 + 2)
#define                                 UTH2_bit            _BIT_ACCESS(ADUTHL,2)
// ADUTHL<UTH3>
extern volatile __bit                   UTH3                __at(0x473);	// @ (0x8E * 8 + 3)
#define                                 UTH3_bit            _BIT_ACCESS(ADUTHL,3)
// ADUTHL<UTH4>
extern volatile __bit                   UTH4                __at(0x474);	// @ (0x8E * 8 + 4)
#define                                 UTH4_bit            _BIT_ACCESS(ADUTHL,4)
// ADUTHL<UTH5>
extern volatile __bit                   UTH5                __at(0x475);	// @ (0x8E * 8 + 5)
#define                                 UTH5_bit            _BIT_ACCESS(ADUTHL,5)
// ADUTHL<UTH6>
extern volatile __bit                   UTH6                __at(0x476);	// @ (0x8E * 8 + 6)
#define                                 UTH6_bit            _BIT_ACCESS(ADUTHL,6)
// ADUTHL<UTH7>
extern volatile __bit                   UTH7                __at(0x477);	// @ (0x8E * 8 + 7)
#define                                 UTH7_bit            _BIT_ACCESS(ADUTHL,7)
// ADUTHH<UTH8>
extern volatile __bit                   UTH8                __at(0x478);	// @ (0x8F * 8 + 0)
#define                                 UTH8_bit            _BIT_ACCESS(ADUTHH,0)
// ADUTHH<UTH9>
extern volatile __bit                   UTH9                __at(0x479);	// @ (0x8F * 8 + 1)
#define                                 UTH9_bit            _BIT_ACCESS(ADUTHH,1)
// ADSTAT<UTHR>
extern volatile __bit                   UTHR                __at(0x8AE);	// @ (0x115 * 8 + 6)
#define                                 UTHR_bit            _BIT_ACCESS(ADSTAT,6)
// VB0GPR<VB0GPR0>
extern volatile __bit                   VB0GPR0             __at(0x7460);	// @ (0xE8C * 8 + 0)
#define                                 VB0GPR0_bit         _BIT_ACCESS(VB0GPR,0)
// VB0GPR<VB0GPR1>
extern volatile __bit                   VB0GPR1             __at(0x7461);	// @ (0xE8C * 8 + 1)
#define                                 VB0GPR1_bit         _BIT_ACCESS(VB0GPR,1)
// VB0GPR<VB0GPR2>
extern volatile __bit                   VB0GPR2             __at(0x7462);	// @ (0xE8C * 8 + 2)
#define                                 VB0GPR2_bit         _BIT_ACCESS(VB0GPR,2)
// VB0GPR<VB0GPR3>
extern volatile __bit                   VB0GPR3             __at(0x7463);	// @ (0xE8C * 8 + 3)
#define                                 VB0GPR3_bit         _BIT_ACCESS(VB0GPR,3)
// VB0GPR<VB0GPR4>
extern volatile __bit                   VB0GPR4             __at(0x7464);	// @ (0xE8C * 8 + 4)
#define                                 VB0GPR4_bit         _BIT_ACCESS(VB0GPR,4)
// VB0GPR<VB0GPR5>
extern volatile __bit                   VB0GPR5             __at(0x7465);	// @ (0xE8C * 8 + 5)
#define                                 VB0GPR5_bit         _BIT_ACCESS(VB0GPR,5)
// VB0GPR<VB0GPR6>
extern volatile __bit                   VB0GPR6             __at(0x7466);	// @ (0xE8C * 8 + 6)
#define                                 VB0GPR6_bit         _BIT_ACCESS(VB0GPR,6)
// VB0GPR<VB0GPR7>
extern volatile __bit                   VB0GPR7             __at(0x7467);	// @ (0xE8C * 8 + 7)
#define                                 VB0GPR7_bit         _BIT_ACCESS(VB0GPR,7)
// VB1GPR<VB1GPR0>
extern volatile __bit                   VB1GPR0             __at(0x7468);	// @ (0xE8D * 8 + 0)
#define                                 VB1GPR0_bit         _BIT_ACCESS(VB1GPR,0)
// VB1GPR<VB1GPR1>
extern volatile __bit                   VB1GPR1             __at(0x7469);	// @ (0xE8D * 8 + 1)
#define                                 VB1GPR1_bit         _BIT_ACCESS(VB1GPR,1)
// VB1GPR<VB1GPR2>
extern volatile __bit                   VB1GPR2             __at(0x746A);	// @ (0xE8D * 8 + 2)
#define                                 VB1GPR2_bit         _BIT_ACCESS(VB1GPR,2)
// VB1GPR<VB1GPR3>
extern volatile __bit                   VB1GPR3             __at(0x746B);	// @ (0xE8D * 8 + 3)
#define                                 VB1GPR3_bit         _BIT_ACCESS(VB1GPR,3)
// VB1GPR<VB1GPR4>
extern volatile __bit                   VB1GPR4             __at(0x746C);	// @ (0xE8D * 8 + 4)
#define                                 VB1GPR4_bit         _BIT_ACCESS(VB1GPR,4)
// VB1GPR<VB1GPR5>
extern volatile __bit                   VB1GPR5             __at(0x746D);	// @ (0xE8D * 8 + 5)
#define                                 VB1GPR5_bit         _BIT_ACCESS(VB1GPR,5)
// VB1GPR<VB1GPR6>
extern volatile __bit                   VB1GPR6             __at(0x746E);	// @ (0xE8D * 8 + 6)
#define                                 VB1GPR6_bit         _BIT_ACCESS(VB1GPR,6)
// VB1GPR<VB1GPR7>
extern volatile __bit                   VB1GPR7             __at(0x746F);	// @ (0xE8D * 8 + 7)
#define                                 VB1GPR7_bit         _BIT_ACCESS(VB1GPR,7)
// VB2GPR<VB2GPR0>
extern volatile __bit                   VB2GPR0             __at(0x7470);	// @ (0xE8E * 8 + 0)
#define                                 VB2GPR0_bit         _BIT_ACCESS(VB2GPR,0)
// VB2GPR<VB2GPR1>
extern volatile __bit                   VB2GPR1             __at(0x7471);	// @ (0xE8E * 8 + 1)
#define                                 VB2GPR1_bit         _BIT_ACCESS(VB2GPR,1)
// VB2GPR<VB2GPR2>
extern volatile __bit                   VB2GPR2             __at(0x7472);	// @ (0xE8E * 8 + 2)
#define                                 VB2GPR2_bit         _BIT_ACCESS(VB2GPR,2)
// VB2GPR<VB2GPR3>
extern volatile __bit                   VB2GPR3             __at(0x7473);	// @ (0xE8E * 8 + 3)
#define                                 VB2GPR3_bit         _BIT_ACCESS(VB2GPR,3)
// VB2GPR<VB2GPR4>
extern volatile __bit                   VB2GPR4             __at(0x7474);	// @ (0xE8E * 8 + 4)
#define                                 VB2GPR4_bit         _BIT_ACCESS(VB2GPR,4)
// VB2GPR<VB2GPR5>
extern volatile __bit                   VB2GPR5             __at(0x7475);	// @ (0xE8E * 8 + 5)
#define                                 VB2GPR5_bit         _BIT_ACCESS(VB2GPR,5)
// VB2GPR<VB2GPR6>
extern volatile __bit                   VB2GPR6             __at(0x7476);	// @ (0xE8E * 8 + 6)
#define                                 VB2GPR6_bit         _BIT_ACCESS(VB2GPR,6)
// VB2GPR<VB2GPR7>
extern volatile __bit                   VB2GPR7             __at(0x7477);	// @ (0xE8E * 8 + 7)
#define                                 VB2GPR7_bit         _BIT_ACCESS(VB2GPR,7)
// VB3GPR<VB3GPR0>
extern volatile __bit                   VB3GPR0             __at(0x7478);	// @ (0xE8F * 8 + 0)
